
//-------------------------------------------------<                      axlib v1.1                       >----------------------------------------------------
//-------------------------------------------------< Библиотека для работы с датчиком давления от DFP-2106 >----------------------------------------------------
//-------------------------------------------------<       Кузнецов Алексей 2015 http://www.avrki.ru       >----------------------------------------------------


#ifndef PSENSOR_VAZ_H_
#define PSENSOR_VAZ_H_

#if !defined(MAIN_INIT_H_)
#error "You must included (#include \"main_init.h\") befor use (#include <axlib/psensor_vaz.h>)."
#endif

//-------------------------------------------------------------------------
//							Подключаемые библиотеки
//-------------------------------------------------------------------------

#include <avr/io.h>
#include <axlib/type_var.h>
#include <axlib/adc.h>

//-------------------------------------------------------------------------
//							Инициализация переменных
//-------------------------------------------------------------------------

volatile WORD r_senser = 300;	// Сопротивление датчика при нулу
volatile WORD r_2 = 22;			// Сопртивление нижнего плеча
volatile ADATA p_max = 8;		// Максимальное давление
volatile ADATA u_input = 5;		// Велечина опорного напряжения
volatile ADATA k_adc = 0.004882;
volatile ADATA k_up	= 110;
volatile ADATA k_p = 0.02667;

//-------------------------------------------------------------------------
//	Функция инициализации датчика.
//
//	Принемаемый аргумент:
//
//		BYTE inref -Включение/выключение внутреннего ИОН
//-------------------------------------------------------------------------

void p_sensor_vaz_init(void)
{
	adc_init(u_input, ADC_IREF_OFF);
}

//-------------------------------------------------------------------------
//	Функция инициализации датчика.
//
//	Принемаемый аргумент:
//
//		WORD rs - Сопротивление датчика при нуле в Ом
//		WORD r2	- Сопротивление нижнего плеча в Ом
//		ADATA pmax - Максимальное давление в кг/см
//		ADATA u_in - Величина опорного напряжения АЦП микроконтроллера
//		BYTE inref -Включение/выключение внутреннего ИОН
//-------------------------------------------------------------------------

void p_sensor_vaz_init_data(WORD rs, WORD r2, ADATA pmax, ADATA u_in, BYTE inref)
{
	r_senser = rs;
	r_2 = r2;
	
	k_up = u_in*r2;
	k_adc = u_in/1024;
	k_p = pmax/rs;
	
	adc_init(u_in, inref);
}

//-------------------------------------------------------------------------
//	Функция Функция возвращает давление.
//
// Принимаемые аргументы:
//
//		BYTE adc_ch -Номер канала АЦП к которому подключен текущий датчик
//
//  Значение давление имеет тип float
//-------------------------------------------------------------------------

ADATA press_vaz(BYTE adc_ch)
{
	WORD adc = adc_data(adc_ch);
		
	return ((r_senser-(k_up/(adc*k_adc)-r_2))*k_p);
}

#endif /* PSENSOR_VAZ_H_ */